note/ssl.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-24 Thu 21:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>https站点证书配置</title>
<meta name="generator" content="Org mode">
<meta name="author" content="manue1">
<link rel="stylesheet" type="text/css" href="css/worg.css" />
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.com">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">https站点证书配置</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org962c409">1. 证书配置安装</a></li>
<li><a href="#org201c7a5">2. 证书定期更新</a></li>
<li><a href="#orgca2398d">3. nginx调用证书</a></li>
</ul>
</div>
</div>
<p>
个人https站点，首选免费开源证书,Let's Encrypt是国外一个公共的免费SSL项目，<br>
由 Linux 基金会托管，由Mozilla、思科、Akamai、IdenTrust和EFF等组织发起，<br>
目的就是向网站自动签发和管理免费证书，以便加速互联网由HTTP过渡到HTTPS。<br>
</p>


<p>
let's encrypt优点:<br>
</p>

<ol class="org-ol">
<li>免费提供90天的电子证书<br></li>
<li>提供certbot工具自动更新证书系统<br></li>
</ol>



<div id="outline-container-org962c409" class="outline-2">
<h2 id="org962c409"><span class="section-number-2">1</span> 证书配置安装</h2>
<div class="outline-text-2" id="text-1">
<p>
let's encrypt 使用certbot这款软件管理电子证书，在安装certbot过程中，提示<br>
机器pyopenssl版本比较低，需要高版本，<a href="http://cbs.centos.org/kojifiles/packages/pyOpenSSL/0.15.1/1.el7/noarch/pyOpenSSL-0.15.1-1.el7.noarch.rpm">pyopenssl高版本下载</a> <br>
<code>sudo rpm -Uvh *.rpm</code> 安装<br>
</p>

<pre class="example">
yum install epel-release -y
yum install certbot -y
pip install certifi 

</pre>

<p>
使用certbot的standalone生成证书之前，需要保证80端口未占用, <code>-d</code> 证书支持<br>
的子域名， <code>-m</code> 通知邮箱<br>
</p>

<pre class="example">
certbot certonly --standalone -d manue1.site -d www.manue1.site -m manue1@foxmail.com

</pre>
</div>
</div>

<div id="outline-container-org201c7a5" class="outline-2">
<h2 id="org201c7a5"><span class="section-number-2">2</span> 证书定期更新</h2>
<div class="outline-text-2" id="text-2">
<p>
crontab 每两月更新证书信息，避免失效, <code>--pre-hook</code> 代表 执行前需要处理的任务，<br>
 <code>--post-hook</code> 代表执行后需要处理的任务<br>
</p>

<pre class="example">
15 2 * */2 * certbot renew --pre-hook "service nginx stop" --post-hook "service nginx start" 

</pre>
</div>
</div>

<div id="outline-container-orgca2398d" class="outline-2">
<h2 id="orgca2398d"><span class="section-number-2">3</span> nginx调用证书</h2>
<div class="outline-text-2" id="text-3">
<p>
将所有80端口流量转发到443端口,443端口服务配上证书认证<br>
</p>

<pre class="example">

server {
  listen 80;
  server_name manue1.site www.manue1.site;
  return 301 https://www.manue1.site$request_uri;
}

server {

       listen  443 ssl;
       server_name  manue1.site www.manue1.site;


       ssl_certificate /etc/letsencrypt/live/manue1.site/fullchain.pem;
       ssl_certificate_key /etc/letsencrypt/live/manue1.site/privkey.pem;

       location / {
           root   /home/manue1/html-pages;
           index  index.html index.htm;
       }

       error_page   500 502 503 504  /50x.html;
       location = /50x.html {
           root   html;
       }

}

</pre>

<p>
至此，个人站点免费配置https证书便搞定了<br>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
<script src="http://www.langdebuqing.com/css/main.js"></script>
</div>
</body>
</html>